In [1]:
import numpy as np

In [2]:
import pandas as pd

In [6]:
df=pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
(df['one'].notnull())

a     True
b    False
c     True
d    False
e     True
f     True
g    False
h     True
Name: one, dtype: bool

In [8]:
(df.notnull())

     one    two  three
a   True   True   True
b  False  False  False
c   True   True   True
d  False  False  False
e   True   True   True
f   True   True   True
g  False  False  False
h   True   True   True

In [16]:
from numpy.random import randn
df=pd.DataFrame(randn(5, 2), index=[0, 1, 2, 3, 4], columns=['one', 'two'])
(df)

        one       two
0 -0.743216 -0.838238
1 -1.386953  1.089896
2  1.238191  0.159955
3  1.419218  0.769347
4 -0.739674  1.024735

In [17]:
(df['one'].sum())

-0.212434307412116

In [18]:
(df['two'].sum())

2.2056937053753085

In [19]:
(df['one'].count())

5

In [24]:
(df['one'].isnull())

0    False
1    False
2    False
3    False
4    False
Name: one, dtype: bool

In [40]:
df=pd.DataFrame({'A':[1,2,np.nan],'B':[5,np.nan,10],'C':[10,np.nan,np.nan]})
print(df)

     A     B     C
0  1.0   5.0  10.0
1  2.0   NaN   NaN
2  NaN  10.0   NaN

In [41]:
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [42]:
df['A'].fillna(value=df.mean())

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [43]:
df.fillna(value=df['A'].mean())

     A     B     C
0  1.0   5.0  10.0
1  2.0   1.5   1.5
2  1.5  10.0   1.5

In [44]:
df['A'].fillna(value=df['A'].sum())

0    1.0
1    2.0
2    3.0
Name: A, dtype: float64

In [45]:
df['A'].fillna(value=df.sum())

0    1.0
1    2.0
2    NaN
Name: A, dtype: float64

In [2]:
import pandas as pd
import numpy as np
from numpy.random import randn

In [3]:
df=pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
(df)

        one       two     three
a  1.927968 -1.753650  0.077883
c  0.225685  1.037855 -0.437223
e -0.726011  0.380298 -0.441317
f -0.449576  1.212083 -0.334462
h  0.297871  0.583059 -3.931659

In [4]:
df=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df

        one       two     three
a  1.927968 -1.753650  0.077883
b       NaN       NaN       NaN
c  0.225685  1.037855 -0.437223
d       NaN       NaN       NaN
e -0.726011  0.380298 -0.441317
f -0.449576  1.212083 -0.334462
g       NaN       NaN       NaN
h  0.297871  0.583059 -3.931659

In [9]:
df.dropna()

        one       two     three
a  1.927968 -1.753650  0.077883
c  0.225685  1.037855 -0.437223
e -0.726011  0.380298 -0.441317
f -0.449576  1.212083 -0.334462
h  0.297871  0.583059 -3.931659

In [10]:
import pandas as pd
import numpy as np
d1=[['a', 20],['b', 21],['c', 21],['d', np.nan]]
df1=pd.DataFrame(d1, columns=['Name','grade'])
print(df1)
print(df1.dropna())

  Name  grade
0    a   20.0
1    b   21.0
2    c   21.0
3    d    NaN
  Name  grade
0    a   20.0
1    b   21.0
2    c   21.0

In [19]:
df=pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
df.dropna(axis=1)

Empty DataFrame
Columns: []
Index: [a, b, c, d, e, f, g, h]

In [21]:
df.dropna(thresh=2)

        one       two     three
a -0.178580 -0.832977 -1.025362
c -0.163061  1.076272  0.967101
e  0.728687 -0.491861 -0.546057
f  1.104597  2.544608  0.326893
h  0.059782 -0.529120  0.272331

In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

In [7]:
df=pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
(df)

        one       two     three
a -0.072061  0.345631 -1.140348
c  0.517154  1.784492  0.098399
e  1.304232  0.195778 -1.940544
f -0.671320 -1.406468  1.551551
h  1.153283  0.273064  1.152456

In [9]:
df=pd.DataFrame(np.random.randn(5, 3), index=['a', 'c', 'e', 'f', 'h'], columns=['one', 'two', 'three'])
df=df.reindex(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h'])
print(df)

        one       two     three
a -1.305434  1.023840 -1.325697
b       NaN       NaN       NaN
c -0.202783 -0.926125 -1.915565
d       NaN       NaN       NaN
e -0.103167 -0.092477  1.326458
f -0.465885 -2.163567 -0.495401
g       NaN       NaN       NaN
h -0.426143 -0.477551 -2.013499

In [1]:
import pandas as pd
import numpy as np

In [2]:
a=pd.DataFrame([[1,2,np.nan],[2,np.nan,np.nan],[np.nan,np.nan,np.nan]])
(a)

     0    1   2
0  1.0  2.0 NaN
1  2.0  NaN NaN
2  NaN  NaN NaN

In [4]:
a.dropna(thresh=1)

     0    1   2
0  1.0  2.0 NaN
1  2.0  NaN NaN

In [5]:
a.dropna(thresh=2)

     0    1   2
0  1.0  2.0 NaN

In [6]:
a.dropna(thresh=3)

Empty DataFrame
Columns: [0, 1, 2]
Index: []